quiz_data = [
    {
        "question": [
            "Какие поделки оставлял коллега Декарта в Бегущем по лезвию?",
            [
                ("1. ", "Оригами"),
                ("2. ", "Конструктор"),
                ("3. ", "Пластелиновые фигурки"),
                ("4. ", "Вязаные игрушки"),
            ],
        ],
        "options": ["1", "2", "3", "4"],
        "correct_option": 0,
    },
    {
        "question": [
            "Как называлась первая часть Индианы Джонса?",
            [
                ("1. ", "Королевство Хрустального черепа"),
                ("2. ", "В поисках утраченного ковчега"),
                ("3. ", "Храм судьбы"),
                ("4. ", "Последний крестовый поход"),
            ],
        ],
        "options": ["1", "2", "3", "4"],
        "correct_option": 1,
    },
    {
        "question": [
            "Кто играет главную роль в Пролетая над гнездом кукушки?",
            [
                ("1. ", "Майкл Китон"),
                ("2. ", "Джек Никлсон"),
                ("3. ", "Уилл Сэмпсон"),
                ("4. ", "Кристофер Ллойд"),
            ],
        ],
        "options": ["1", "2", "3", "4"],
        "correct_option": 1,
    },
    {
        "question": [
            "Кто является режиссерем Назад в будущее?",
            [
                ("1. ", "Стивен Спилберг"),
                ("2. ", "Джорж Лукас"),
                ("3. ", "Милош Форман"),
                ("4. ", "Роберт Земекис"),
            ],
        ],
        "options": ["1", "2", "3", "4"],
        "correct_option": 3,
    },
    {
        "question": [
            "Откуда цитата Жизнь - коробка шоколадных конфет, никогда не знаешь, \
                  какая начинка тебе достанется?",
            [
                ("1. ", "Бойцовский клуб"),
                ("2. ", "1 + 1"),
                ("3. ", "Форрест Гамп"),
                ("4. ", "Невероятная жизнь Уолтера Митти"),
            ],
        ],
        "options": ["1", "2", "3", "4"],
        "correct_option": 2,
    },
    {
        "question": [
            "Ответ на все вопросы?",
            [("1. ", "Его нет"), ("2. ", "Да"), ("3. ", "42"), ("4. ", "Бэйгл")],
        ],
        "options": ["1", "2", "3", "4"],
        "correct_option": 2,
    },
    {
        "question": [
            "Какой из этих актеров НЕ играл в Охотниках за приведениями?",
            [
                ("1. ", "Том Хэнкс"),
                ("2. ", "Билл Мюррей"),
                ("3. ", "Эрни Хадсон"),
                ("4. ", "Гарольд Рэмис"),
            ],
        ],
        "options": ["1", "2", "3", "4"],
        "correct_option": 0,
    },
    {
        "question": [
            "В каком из этих фильмов НЕ играет Джим Керри?",
            [
                ("1. ", "Вечное сияние чистого разума"),
                ("2. ", "Ночь в музее"),
                ("3. ", "Шоу Трумана"),
                ("4. ", "Гринч"),
            ],
        ],
        "options": ["1", "2", "3", "4"],
        "correct_option": 1,
    },
    {
        "question": [
            "Кто писал музыку к Властелину колец?",
            [
                ("1. ", "Эннио Морриконе"),
                ("2. ", "Джон Уильямс"),
                ("3. ", "Ханц Зиммер"),
                ("4. ", "Говард Шор"),
            ],
        ],
        "options": ["1", "2", "3", "4"],
        "correct_option": 3,
    },
    {
        "question": [
            "Правда ли, что внутри обоих дроидов (С-3PO и R2D2) из Звездных войн \
                    (оригинальная трилогия) сидели реальные актеры?",
            [
                ("1. ", "Полностью неправда"),
                ("2. ", "Только в C3PO"),
                ("3. ", "Только в R2D2"),
                ("4. ", "Полностью правда"),
            ],
        ],
        "options": ["1", "2", "3", "4"],
        "correct_option": 3,
    },
]
